# Course 4 Lab 14 - Selecting Data in a Dataframe

In [2]:
# import the pandas library
import pandas as pd

In [3]:
# define a dictionary x
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}
# casting the dictionary to a dataframe
df = pd.DataFrame(x)
# display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

### Column Selection

In [4]:
# retrieving the ID column and assigning it to a variable x
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [5]:
# check the type of x
type(x)

pandas.core.frame.DataFrame

In [6]:
# accessing multiple columns
z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

### Practice

In [7]:
# create a dataframe
A = {'Student':['David','Samuel','Terry','Evan'],'Age':[27,24,22,32],'Country':['UK','Canada','China','USA'],'Course':['Python','Data Structures','Machine Learning','Web Development'], 'Marks':[85,72,89,76]}
df=pd.DataFrame(A)
df

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [8]:
# retrieve the marks column and assign it to a variable b
b = df[['Marks']]
b

   Marks
0     85
1     72
2     89
3     76

In [9]:
# retrieve the country and course columns and assign it to a variable c
c = df[['Country','Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

### view column as a series

In [11]:
# get the name column as a series object
x = df['Student']
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [12]:
# check the type of x
type(x)

pandas.core.series.Series

### iloc and loc functions
<code>loc()</code> is a label-based data selecting method which means that we have to pass the name of the row or column that we want to select. This method includes the last element of the range passed in it.

*   loc\[row_label, column_label]

<code>iloc()</code> is an indexed-based selecting method which means that we have to pass integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it.

*   iloc\[row_index, column_index]

In [13]:
# access the value on the first row and the first column
df.iloc[0,0]

'David'

In [15]:
# access the column using the name
df.loc[0,'Course']

'Python'

In [17]:
# define a dictionary x
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}
# casting the dictionary to a dataframe
df = pd.DataFrame(x)
# display the result df
df
# create a new dataframe
df1=df
df1=df1.set_index('Name')

In [18]:
# to display the first 5 rows of new dataframe
df1.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [20]:
# access the column using the name
df1.loc['Jane','Salary']

50000

### Exercise 2

In [21]:
# use the loc() function to get the department of Jane
df1.loc['Jane','Department']

'Design Team'

In [23]:
# use the iloc() function to get the salary of mary
df1.iloc[3,2]

60000

### Slicing

In [24]:
# slicing
df.iloc[0:2,0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [26]:
# slicing using the loc function
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [27]:
# slicing using loc
df1.loc['Rose':'Jane','ID':'Department']

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team

### Exercise 3

In [28]:
# using the loc function retrieve the name, id, and department of index column having labels as 2,3
df.loc[2:3,'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure